tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66k22_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F66K22_H_
#define _PIC18F66K22_H_

#define PMD3                          0
#define TMR12MD                       1
#define CCP4MD                        2
#define CCP5MD                        3
#define CCP6MD                        4
#define CCP7MD                        5
#define CCP8MD                        6
#define CCP9MD                        7
#define CCP10MD                       8
#define PMD2                          9
#define CMP1MD                        10
#define CMP2MD                        11
#define CMP3MD                        12
#define TMR5MD                        13
#define TMR6MD                        14
#define TMR7MD                        15
#define TMR8MD                        16
#define TMR10MD                       17
#define PMD1                          18
#define TMR1MD                        19
#define TMR2MD                        20
#define TMR3MD                        21
#define TMR4MD                        22
#define RTCCMD                        23
#define CTMUMD                        24
#define PSPMD                         25
#define PMD0                          26
#define ADCMD                         27
#define SSP1MD                        28
#define SPI1MD                        29
#define SPI2MD                        30
#define SSP2MD                        31
#define UART1MD                       32
#define UART2MD                       33
#define CCP1MD                        34
#define CCP2MD                        35
#define CCP3MD                        36
#define PSTR3CON                      37
#define PSTR3CON_STRA                 38
#define STRA3                         39
#define STRB3                         40
#define PSTR3CON_STRB                 41
#define PSTR3CON_STRC                 42
#define STRC3                         43
#define STRD3                         44
#define PSTR3CON_STRD                 45
#define STRSYNC3                      46
#define PSTR3CON_STRSYNC              47
#define PSTR3CON_CMPL0                48
#define CMPL03                        49
#define PSTR3CON_CMPL                 50
#define CMPL13                        51
#define PSTR3CON_CMPL1                52
#define PSTR2CON                      53
#define PSTR2CON_STRA                 54
#define P2DC02                        55
#define STRA2                         56
#define P2DC0CON                      57
#define STRB2                         58
#define P2DC12                        59
#define PSTR2CON_STRB                 60
#define P2DC1CON                      61
#define STRC2                         62
#define PSTR2CON_STRC                 63
#define P2DC22                        64
#define P2DC2CON                      65
#define P2DC32                        66
#define STRD2                         67
#define PSTR2CON_STRD                 68
#define P2DC3CON                      69
#define P2DC4CON                      70
#define STRSYNC2                      71
#define PSTR2CON_STRSYNC              72
#define P2DC42                        73
#define P2DC6CON                      74
#define PSTR2CON_CMPL                 75
#define CMPL02                        76
#define P2DC62                        77
#define PSTR2CON_CMPL0                78
#define CMPL12                        79
#define PSTR2CON_CMPL1                80
#define TXREG2                        81
#define RCREG2                        82
#define SPBRG2                        83
#define SPBRGH2                       84
#define BAUDCON2                      85
#define ABDEN2                        86
#define BAUDCON2_ABDEN                87
#define WUE2                          88
#define BAUDCON2_WUE                  89
#define BRG162                        90
#define BAUDCON2_BRG16                91
#define SCKP2                         92
#define TXCKP2                        93
#define BAUDCON2_TXCKP                94
#define DTRXP2                        95
#define RXDTP2                        96
#define BAUDCON2_RXDTP                97
#define RCMT2                         98
#define RCIDL2                        99
#define BAUDCON2_RCIDL                100
#define BAUDCON2_ABDOVF               101
#define ABDOVF2                       102
#define TXSTA2                        103
#define TX9D2                         104
#define TXSTA2_TX9D                   105
#define TXD82                         106
#define TRMT2                         107
#define TXSTA2_TRMT                   108
#define BRGH2                         109
#define TXSTA2_BRGH                   110
#define SENDB2                        111
#define TXSTA2_SENDB                  112
#define TXSTA2_SYNC                   113
#define SYNC2                         114
#define TXEN2                         115
#define TXSTA2_TXEN                   116
#define TX8_92                        117
#define TX92                          118
#define TXSTA2_TX9                    119
#define TXSTA2_CSRC                   120
#define CSRC2                         121
#define RCSTA2                        122
#define RCD82                         123
#define RX9D2                         124
#define RCSTA2_RX9D                   125
#define OERR2                         126
#define RCSTA2_OERR                   127
#define FERR2                         128
#define RCSTA2_FERR                   129
#define ADDEN2                        130
#define RCSTA2_ADDEN                  131
#define RCSTA2_CREN                   132
#define CREN2                         133
#define SREN2                         134
#define RCSTA2_SREN                   135
#define RC92                          136
#define RC8_92                        137
#define RCSTA2_RX9                    138
#define RX92                          139
#define RCSTA2_SPEN                   140
#define SPEN2                         141
#define ANCON2                        142
#define PCFG16                        143
#define ANSEL16                       144
#define PCFG17                        145
#define ANSEL17                       146
#define PCFG18                        147
#define ANSEL18                       148
#define PCFG19                        149
#define ANSEL19                       150
#define ANCON1                        151
#define ANSEL8                        152
#define PCFG8                         153
#define ANSEL9                        154
#define PCFG9                         155
#define PCFG10                        156
#define ANSEL10                       157
#define ANSEL11                       158
#define PCFG11                        159
#define ANCON0                        160
#define ANSEL0                        161
#define PCFG0                         162
#define ANSEL1                        163
#define PCFG1                         164
#define ANSEL2                        165
#define PCFG2                         166
#define ANSEL3                        167
#define PCFG3                         168
#define ANSEL4                        169
#define PCFG4                         170
#define ANSEL5                        171
#define PCFG5                         172
#define ANSEL6                        173
#define PCFG6                         174
#define ANSEL7                        175
#define PCFG7                         176
#define ODCON3                        177
#define CTMUDS                        178
#define U1OD                          179
#define U2OD                          180
#define ODCON2                        181
#define CCP3OD                        182
#define CCP4OD                        183
#define CCP5OD                        184
#define CCP6OD                        185
#define CCP7OD                        186
#define CCP8OD                        187
#define CCP9OD                        188
#define CCP10OD                       189
#define ODCON1                        190
#define SPI2OD                        191
#define CCP1OD                        192
#define CCP2OD                        193
#define SPI1OD                        194
#define REFOCON                       195
#define RODIV0                        196
#define RODIV                         197
#define RODIV1                        198
#define RODIV2                        199
#define RODIV3                        200
#define ROSEL                         201
#define ROSSLP                        202
#define ROON                          203
#define CCPTMRS2                      204
#define C8TSEL0                       205
#define C8TSEL                        206
#define C8TSEL1                       207
#define C9TSEL0                       208
#define C10TSEL0                      209
#define CCPTMRS1                      210
#define C4TSEL                        211
#define C4TSEL0                       212
#define C4TSEL1                       213
#define C5TSEL0                       214
#define C6TSEL0                       215
#define C7TSEL                        216
#define C7TSEL0                       217
#define C7TSEL1                       218
#define CCPTMRS0                      219
#define C1TSEL0                       220
#define C1TSEL                        221
#define C1TSEL1                       222
#define C1TSEL2                       223
#define C2TSEL0                       224
#define C2TSEL                        225
#define C2TSEL1                       226
#define C2TSEL2                       227
#define C3TSEL0                       228
#define C3TSEL                        229
#define C3TSEL1                       230
#define CM3CON                        231
#define CM3CON_CCH                    232
#define CCH03                         233
#define CM3CON_CCH0                   234
#define CCH13                         235
#define CM3CON_CCH1                   236
#define CM3CON_CREF                   237
#define CREF3                         238
#define CM3CON_EVPOL                  239
#define EVPOL03                       240
#define CM3CON_EVPOL0                 241
#define CM3CON_EVPOL1                 242
#define EVPOL13                       243
#define CM3CON_CPOL                   244
#define CPOL3                         245
#define COE3                          246
#define CM3CON_COE                    247
#define CM3CON_CON                    248
#define CON3                          249
#define CM2CON                        250
#define CM2CON_CCH                    251
#define CM2CON_CCH0                   252
#define CCH02                         253
#define CCH12                         254
#define CM2CON_CCH1                   255
#define CM2CON_CREF                   256
#define CREF2                         257
#define CM2CON_EVPOL                  258
#define EVPOL02                       259
#define CM2CON_EVPOL0                 260
#define EVPOL12                       261
#define CM2CON_EVPOL1                 262
#define CM2CON_CPOL                   263
#define CPOL2                         264
#define CM2CON_COE                    265
#define COE2                          266
#define CM2CON_CON                    267
#define CON2                          268
#define T12CON                        269
#define T12CKPS0                      270
#define T12CKPS                       271
#define T12CKPS1                      272
#define TMR12ON                       273
#define T12OUTPS0                     274
#define T12OUTPS                      275
#define T12OUTPS1                     276
#define T12OUTPS2                     277
#define T12OUTPS3                     278
#define PR12                          279
#define TMR12                         280
#define T10CON                        281
#define T10CKPS                       282
#define T10CKPS0                      283
#define T10CKPS1                      284
#define TMR10ON                       285
#define T10OUTPS0                     286
#define T10OUTPS                      287
#define T10OUTPS1                     288
#define T10OUTPS2                     289
#define T10OUTPS3                     290
#define PR10                          291
#define TMR10                         292
#define T8CON                         293
#define T8CKPS0                       294
#define T8CKPS                        295
#define T8CKPS1                       296
#define TMR8ON                        297
#define T8OUTPS                       298
#define T8OUTPS0                      299
#define T8OUTPS1                      300
#define T8OUTPS2                      301
#define T8OUTPS3                      302
#define PR8                           303
#define TMR8                          304
#define T6CON                         305
#define T6CKPS0                       306
#define T6CKPS                        307
#define T6CKPS1                       308
#define TMR6ON                        309
#define T6OUTPS0                      310
#define T6OUTPS                       311
#define T6OUTPS1                      312
#define T6OUTPS2                      313
#define T6OUTPS3                      314
#define PR6                           315
#define TMR6                          316
#define T7GCON                        317
#define T7GSS0                        318
#define T7GSS                         319
#define T7GSS1                        320
#define T7GVAL                        321
#define nT7DONE                       322
#define T7GGO_NOT_T7DONE              323
#define NOT_T7DONE                    324
#define T7GGO_nT7DONE                 325
#define T7GGO                         326
#define T7GSPM                        327
#define T7GTM                         328
#define T7GPOL                        329
#define TMR7GE                        330
#define T7CON                         331
#define TMR7ON                        332
#define T7CON_RD16                    333
#define RD167                         334
#define nT7SYNC                       335
#define NOT_T7SYNC                    336
#define SOSCEN7                       337
#define T7CON_SOSCEN                  338
#define T7CKPS                        339
#define T7CKPS0                       340
#define T7CKPS1                       341
#define TMR7CS                        342
#define TMR7CS0                       343
#define TMR7CS1                       344
#define TMR7L                         345
#define CAL07                         346
#define CAL17                         347
#define CAL27                         348
#define CAL37                         349
#define CAL47                         350
#define CAL57                         351
#define CAL67                         352
#define CAL77                         353
#define TMR7H                         354
#define CCP10CON                      355
#define CCP10M                        356
#define CCP10M0                       357
#define CCP10M1                       358
#define CCP10M2                       359
#define CCP10M3                       360
#define CCP10Y                        361
#define DC10B0                        362
#define DC10B                         363
#define CCP10X                        364
#define DC10B1                        365
#define CCPR10L                       366
#define CCPR10H                       367
#define CCP9CON                       368
#define CCP9M0                        369
#define CCP9M                         370
#define CCP9M1                        371
#define CCP9M2                        372
#define CCP9M3                        373
#define CCP9Y                         374
#define DC9B0                         375
#define DC9B                          376
#define CCP9X                         377
#define DC9B1                         378
#define CCPR9L                        379
#define CCPR9H                        380
#define CCP8CON                       381
#define CCP8M0                        382
#define CCP8M                         383
#define CCP8M1                        384
#define CCP8M2                        385
#define CCP8M3                        386
#define DC8B0                         387
#define CCP8Y                         388
#define DC8B                          389
#define DC8B1                         390
#define CCP8X                         391
#define CCPR8L                        392
#define CCPR8H                        393
#define CCP3CON                       394
#define CCP3M                         395
#define CCP3M0                        396
#define CCP3M1                        397
#define CCP3M2                        398
#define CCP3M3                        399
#define DC3B                          400
#define DC3B0                         401
#define DC3B1                         402
#define P3M                           403
#define P3M0                          404
#define P3M1                          405
#define CCPR3L                        406
#define CCPR3H                        407
#define ECCP3DEL                      408
#define P3DC                          409
#define P3DC0                         410
#define P3DC1                         411
#define P3DC2                         412
#define P3DC3                         413
#define P3DC4                         414
#define P3DC5                         415
#define P3DC6                         416
#define P3RSEN                        417
#define PSS3BD0                       418
#define PSS3BD                        419
#define PSS3BD1                       420
#define PSS3AC0                       421
#define PSS3AC                        422
#define PSS3AC1                       423
#define ECCP3AS                       424
#define ECCP3AS0                      425
#define ECCP3AS1                      426
#define ECCP3AS2                      427
#define ECCP3ASE                      428
#define CCP2CON                       429
#define CCP2M                         430
#define CCP2M0                        431
#define CCP2M1                        432
#define CCP2M2                        433
#define CCP2M3                        434
#define DC2B                          435
#define DC2B0                         436
#define CCP2Y                         437
#define DC2B1                         438
#define CCP2X                         439
#define P2M                           440
#define P2M0                          441
#define P2M1                          442
#define CCPR2L                        443
#define CCPR2H                        444
#define ECCP2DEL                      445
#define P2DC                          446
#define P2DC0                         447
#define P2DC1                         448
#define P2DC2                         449
#define P2DC3                         450
#define P2DC4                         451
#define P2DC5                         452
#define P2DC6                         453
#define P2RSEN                        454
#define PSS2BD                        455
#define PSS2BD0                       456
#define PSS2BD1                       457
#define PSS2AC0                       458
#define PSS2AC                        459
#define PSS2AC1                       460
#define ECCP2AS0                      461
#define ECCP2AS                       462
#define ECCP2AS1                      463
#define ECCP2AS2                      464
#define ECCP2ASE                      465
#define PADCFG1                       466
#define RTSECSEL0                     467
#define RTSECSEL                      468
#define RTSECSEL1                     469
#define REPU                          470
#define RDPU                          471
#define CM1CON                        472
#define CM1CON_CCH                    473
#define C1CH0                         474
#define CM1CON_CCH0                   475
#define CCH01                         476
#define CCH11                         477
#define C1CH1                         478
#define CM1CON_CCH1                   479
#define CM1CON_CREF                   480
#define CREF1                         481
#define EVPOL01                       482
#define CM1CON_EVPOL0                 483
#define CM1CON_EVPOL                  484
#define CM1CON_EVPOL1                 485
#define EVPOL11                       486
#define CM1CON_CPOL                   487
#define CPOL1                         488
#define CM1CON_COE                    489
#define COE1                          490
#define CM1CON_CON                    491
#define CON1                          492
#define CTMUICON                      493
#define IRNG                          494
#define IRNG0                         495
#define IRNG1                         496
#define ITRIM0                        497
#define ITRIM                         498
#define ITRIM1                        499
#define ITRIM2                        500
#define ITRIM3                        501
#define ITRIM4                        502
#define ITRIM5                        503
#define CTMUCONL                      504
#define EDG1STAT                      505
#define EDG2STAT                      506
#define EDG1SEL                       507
#define EDG1SEL0                      508
#define EDG1SEL1                      509
#define EDG1POL                       510
#define EDG2SEL0                      511
#define EDG2SEL                       512
#define EDG2SEL1                      513
#define EDG2POL                       514
#define CTMUCONH                      515
#define CTTRIG                        516
#define IDISSEN                       517
#define EDGSEQEN                      518
#define EDGEN                         519
#define TGEN                          520
#define CTMUSIDL                      521
