tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66k22_tdd.h
#define LATB6                         1091
#define LB7                           1092
#define LATB7                         1093
#define LATC                          1094
#define LATC0                         1095
#define LC0                           1096
#define LATC1                         1097
#define LC1                           1098
#define LATC2                         1099
#define LC2                           1100
#define LATC3                         1101
#define LC3                           1102
#define LATC4                         1103
#define LC4                           1104
#define LATC5                         1105
#define LC5                           1106
#define LATC6                         1107
#define LC6                           1108
#define LATC7                         1109
#define LC7                           1110
#define LATD                          1111
#define LATD0                         1112
#define LD0                           1113
#define LATD1                         1114
#define LD1                           1115
#define LATD2                         1116
#define LD2                           1117
#define LATD3                         1118
#define LD3                           1119
#define LATD4                         1120
#define LD4                           1121
#define LATD5                         1122
#define LD5                           1123
#define LATD6                         1124
#define LD6                           1125
#define LATD7                         1126
#define LD7                           1127
#define LATE                          1128
#define LATE0                         1129
#define LE0                           1130
#define LATE1                         1131
#define LE1                           1132
#define LATE2                         1133
#define LE2                           1134
#define LATE3                         1135
#define LE3                           1136
#define LATE4                         1137
#define LE4                           1138
#define LATE5                         1139
#define LE5                           1140
#define LATE6                         1141
#define LE6                           1142
#define LATE7                         1143
#define LE7                           1144
#define LATF                          1145
#define LATF1                         1146
#define LF1                           1147
#define LF2                           1148
#define LATF2                         1149
#define LF3                           1150
#define LATF3                         1151
#define LF4                           1152
#define LATF4                         1153
#define LF5                           1154
#define LATF5                         1155
#define LF6                           1156
#define LATF6                         1157
#define LF7                           1158
#define LATF7                         1159
#define LATG                          1160
#define LATG0                         1161
#define LG0                           1162
#define LATG1                         1163
#define LG1                           1164
#define LATG2                         1165
#define LG2                           1166
#define LATG3                         1167
#define LG3                           1168
#define LATG4                         1169
#define LG4                           1170
#define TRISA                         1171
#define TRISA0                        1172
#define TRISA1                        1173
#define TRISA2                        1174
#define TRISA3                        1175
#define TRISA4                        1176
#define TRISA5                        1177
#define TRISA6                        1178
#define TRISA7                        1179
#define TRISB                         1180
#define TRISB0                        1181
#define TRISB1                        1182
#define TRISB2                        1183
#define TRISB3                        1184
#define TRISB4                        1185
#define TRISB5                        1186
#define TRISB6                        1187
#define TRISB7                        1188
#define TRISC                         1189
#define TRISC0                        1190
#define TRISC1                        1191
#define TRISC2                        1192
#define TRISC3                        1193
#define TRISC4                        1194
#define TRISC5                        1195
#define TRISC6                        1196
#define TRISC7                        1197
#define TRISD                         1198
#define TRISD0                        1199
#define TRISD1                        1200
#define TRISD2                        1201
#define TRISD3                        1202
#define TRISD4                        1203
#define TRISD5                        1204
#define TRISD6                        1205
#define TRISD7                        1206
#define TRISE                         1207
#define TRISE0                        1208
#define TRISE1                        1209
#define TRISE2                        1210
#define TRISE3                        1211
#define TRISE4                        1212
#define TRISE5                        1213
#define TRISE6                        1214
#define TRISE7                        1215
#define TRISF                         1216
#define TRISF1                        1217
#define TRISF2                        1218
#define TRISF3                        1219
#define TRISF4                        1220
#define TRISF5                        1221
#define TRISF6                        1222
#define TRISF7                        1223
#define TRISG                         1224
#define TRISG0                        1225
#define TRISG1                        1226
#define TRISG2                        1227
#define TRISG3                        1228
#define TRISG4                        1229
#define OSCTUNE                       1230
#define TUN0                          1231
#define TUN                           1232
#define TUN1                          1233
#define TUN2                          1234
#define TUN3                          1235
#define TUN4                          1236
#define TUN5                          1237
#define PLLEN                         1238
#define INTSRC                        1239
#define PSTR1CON                      1240
#define PSTR1CON_STRA                 1241
#define PSTR1CON_STRB                 1242
#define PSTR1CON_STRC                 1243
#define PSTR1CON_STRD                 1244
#define PSTR1CON_STRSYNC              1245
#define PSTR1CON_CMPL0                1246
#define PSTR1CON_CMPL                 1247
#define PSTR1CON_CMPL1                1248
#define PIE1                          1249
#define TMR1IE                        1250
#define TMR2IE                        1251
#define TMR1GIE                       1252
#define SSP1IE                        1253
#define SSPIE                         1254
#define TXIE                          1255
#define TX1IE                         1256
#define RCIE                          1257
#define RC1IE                         1258
#define ADIE                          1259
#define PSPIE                         1260
#define PIR1                          1261
#define TMR1IF                        1262
#define TMR2IF                        1263
#define TMR1GIF                       1264
#define SSPIF                         1265
#define SSP1IF                        1266
#define TXIF                          1267
#define TX1IF                         1268
#define RCIF                          1269
#define RC1IF                         1270
#define ADIF                          1271
#define PSPIF                         1272
#define IPR1                          1273
#define TMR1IP                        1274
#define TMR2IP                        1275
#define TMR1GIP                       1276
#define SSPIP                         1277
#define SSP1IP                        1278
#define TX1IP                         1279
#define TXIP                          1280
#define RCIP                          1281
#define RC1IP                         1282
#define ADIP                          1283
#define PSPIP                         1284
#define PIE2                          1285
#define TMR3GIE                       1286
#define TMR3IE                        1287
#define HLVDIE                        1288
#define LVDIE                         1289
#define BCL1IE                        1290
#define BCLIE                         1291
#define BCL2IE                        1292
#define SSP2IE                        1293
#define OSCFIE                        1294
#define PIR2                          1295
#define TMR3GIF                       1296
#define TMR3IF                        1297
#define HLVDIF                        1298
#define LVDIF                         1299
#define BCLIF                         1300
#define BCL1IF                        1301
#define BCL2IF                        1302
#define SSP2IF                        1303
#define OSCFIF                        1304
#define IPR2                          1305
#define TMR3GIP                       1306
#define TMR3IP                        1307
#define HLVDIP                        1308
#define LVDIP                         1309
#define BCLIP                         1310
#define BCL1IP                        1311
#define BCL2IP                        1312
#define SSP2IP                        1313
#define OSCFIP                        1314
#define PIE3                          1315
#define RXB0IE                        1316
#define RTCCIE                        1317
#define RXBNIE                        1318
#define CCP1IE                        1319
#define RXB1IE                        1320
#define CCP2IE                        1321
#define TXB0IE                        1322
#define CTMUIE                        1323
#define TXB1IE                        1324
#define TXBNIE                        1325
#define TXB2IE                        1326
#define TX2IE                         1327
#define RC2IE                         1328
#define TMR5GIE                       1329
#define PIR3                          1330
#define RTCCIF                        1331
#define RXBNIF                        1332
#define CCP1IF                        1333
#define CCP2IF                        1334
#define CTMUIF                        1335
#define TXBNIF                        1336
#define TX2IF                         1337
#define RC2IF                         1338
#define TMR5GIF                       1339
#define IPR3                          1340
#define RTCCIP                        1341
#define CCP1IP                        1342
#define RXBNIP                        1343
#define CCP2IP                        1344
#define CTMUIP                        1345
#define TX2IP                         1346
#define TXBNIP                        1347
#define RC2IP                         1348
#define TMR5GIP                       1349
#define PIR6                          1350
#define CMP1IF                        1351
#define CMP2IF                        1352
#define CMP3IF                        1353
#define EEIF                          1354
#define PSPCON                        1355
#define PSPMODE                       1356
#define IBOV                          1357
#define OBF                           1358
#define IBF                           1359
#define HLVDCON                       1360
#define HLVDL                         1361
#define HLVDL0                        1362
#define HLVDL1                        1363
#define HLVDL2                        1364
#define HLVDL3                        1365
#define HLVDEN                        1366
#define IRVST                         1367
#define BGVST                         1368
#define VDIRMAG                       1369
#define IPR6                          1370
#define CMP1IP                        1371
#define CMP2IP                        1372
#define CMP3IP                        1373
#define EEIP                          1374
#define T1GCON                        1375
#define T1GSS0                        1376
#define T1GSS                         1377
#define T1GSS1                        1378
#define T1GVAL                        1379
#define T1GGO_nT1DONE                 1380
#define nT1DONE                       1381
#define T1GGO_NOT_T1DONE              1382
#define NOT_T1DONE                    1383
#define T1GGO                         1384
#define T1GSPM                        1385
#define T1GTM                         1386
#define T1GPOL                        1387
#define TMR1GE                        1388
#define RCSTA1                        1389
#define RCSTA1_RX9D                   1390
#define RX9D1                         1391
#define RCD8                          1392
#define RCSTA1_OERR                   1393
#define OERR1                         1394
#define RCSTA1_FERR                   1395
#define FERR1                         1396
#define RCSTA1_ADDEN                  1397
#define ADDEN1                        1398
#define ADEN                          1399
#define RCSTA1_CREN                   1400
#define CREN1                         1401
#define SRENA                         1402
#define SREN1                         1403
#define RCSTA1_SREN                   1404
#define RC8_9                         1405
#define RCSTA1_RX9                    1406
#define nRC8                          1407
#define NOT_RC8                       1408
#define RC9                           1409
#define RX91                          1410
#define RCSTA1_SPEN                   1411
#define SPEN1                         1412
#define TXSTA1                        1413
#define TX9D1                         1414
#define TXSTA1_TX9D                   1415
#define TXD8                          1416
#define TRMT1                         1417
#define TXSTA1_TRMT                   1418
#define BRGH1                         1419
#define TXSTA1_BRGH                   1420
#define TXSTA1_SENDB                  1421
#define SENDB1                        1422
#define TXSTA1_SYNC                   1423
#define SYNC1                         1424
#define TXEN1                         1425
#define TXSTA1_TXEN                   1426
#define TX91                          1427
#define TX8_9                         1428
#define NOT_TX8                       1429
#define nTX8                          1430
#define TXSTA1_TX9                    1431
#define TXSTA1_CSRC                   1432
#define CSRC1                         1433
#define TXREG1                        1434
#define RCREG1                        1435
#define SPBRG1                        1436
#define T3GCON                        1437
#define T3GSS0                        1438
#define T3GSS                         1439
#define T3GSS1                        1440
#define T3GVAL                        1441
#define T3GGO                         1442
#define NOT_T3DONE                    1443
#define nT3DONE                       1444
#define T3GGO_nT3DONE                 1445
#define T3GGO_NOT_T3DONE              1446
#define T3GSPM                        1447
#define T3GTM                         1448
#define T3GPOL                        1449
#define TMR3GE                        1450
#define T3CON                         1451
#define TMR3ON                        1452
#define T3CON_RD16                    1453
#define nT3SYNC                       1454
#define NOT_T3SYNC                    1455
#define SOSCEN3                       1456
#define T3CON_SOSCEN                  1457
#define T3CKPS0                       1458
#define T3CKPS                        1459
#define T3CKPS1                       1460
#define TMR3CS0                       1461
#define TMR3CS                        1462
#define TMR3CS1                       1463
#define T3RD16                        1464
#define RD163                         1465
#define TMR3L                         1466
#define TMR3H                         1467
#define CMSTAT                        1468
#define CMSTAT_C1OUT                  1469
#define CMP1OUT                       1470
#define CMSTAT_C2OUT                  1471
#define CMP2OUT                       1472
#define CMP3OUT                       1473
#define CMSTAT_C3OUT                  1474
#define CVRCON                        1475
#define CVR                           1476
#define CVR0                          1477
#define CVR1                          1478
#define CVR2                          1479
#define CVR3                          1480
#define CVR4                          1481
#define CVRR                          1482
#define CVRSS                         1483
#define CVROEN                        1484
#define CVROE                         1485
#define CVREN                         1486
#define PIE4                          1487
#define CCP3IE                        1488
#define CCP4IE                        1489
#define CCP5IE                        1490
#define CCP6IE                        1491
#define CCP7IE                        1492
#define CCP8IE                        1493
#define CCP9IE                        1494
#define CCP10IE                       1495
#define PIR4                          1496
#define CCP3IF                        1497
#define CCP4IF                        1498
#define CCP5IF                        1499
#define CCP6IF                        1500
#define CCP7IF                        1501
#define CCP8IF                        1502
#define CCP9IF                        1503
#define CCP10IF                       1504
#define IPR4                          1505
#define CCP3IP                        1506
#define CCIP3IP                       1507
#define CCP4IP                        1508
#define CCP5IP                        1509
#define CCP6IP                        1510
#define CCP7IP                        1511
#define CCP8IP                        1512
#define CCP9IP                        1513
#define CCP10IP                       1514
#define PIE5                          1515
#define TMR4IE                        1516
#define TMR5IE                        1517
#define TMR6IE                        1518
#define TMR7IE                        1519
#define TMR8IE                        1520
#define TMR10IE                       1521
#define TMR12IE                       1522
#define TMR7GIE                       1523
#define PIR5                          1524
#define TMR4IF                        1525
#define TMR5IF                        1526
#define TMR6IF                        1527
#define TMR7IF                        1528
#define TMR8IF                        1529
#define TMR10IF                       1530
#define TMR12IF                       1531
#define TMR7GIF                       1532
#define CCP1CON                       1533
#define CCP1M0                        1534
#define CCP1M                         1535
#define CCP1M1                        1536
#define CCP1M2                        1537
#define CCP1M3                        1538
#define CCP1Y                         1539
#define DC1B                          1540
#define DC1B0                         1541
#define CCP1X                         1542
#define DC1B1                         1543
#define P1M                           1544
#define P1M0                          1545
#define P1M1                          1546
#define CCPR1L                        1547
#define CCPR1H                        1548
#define ECCP1DEL                      1549
#define P1DC                          1550
#define P1DC0                         1551
#define P1DC1                         1552
#define P1DC2                         1553
#define P1DC3                         1554
#define P1DC4                         1555
#define P1DC5                         1556
#define P1DC6                         1557
#define P1RSEN                        1558
#define PSS1BD0                       1559
#define PSS1BD                        1560
#define PSS1BD1                       1561
#define PSS1AC                        1562
#define PSS1AC0                       1563
#define PSS1AC1                       1564
#define ECCP1AS                       1565
#define ECCP1AS0                      1566
#define ECCP1AS1                      1567
#define ECCP1AS2                      1568
#define ECCP1ASE                      1569
#define ADCON2                        1570
#define ADCS0                         1571
#define ADCS                          1572
#define ADCS1                         1573
#define ADCS2                         1574
#define ACQT0                         1575
#define ACQT                          1576
#define ACQT1                         1577
#define ACQT2                         1578
#define ADFM                          1579
#define ADCON1                        1580
#define CHSN0                         1581
#define CHSN                          1582
#define CHSN1                         1583
#define CHSN2                         1584
#define VNCFG                         1585
#define CHSN3                         1586
#define VCFG                          1587
#define VCFG01                        1588
#define VCFG0                         1589
#define VCFG11                        1590
#define VCFG1                         1591
#define TRIGSEL                       1592
#define TRIGSEL0                      1593
#define TRIGSEL1                      1594
#define ADCON0                        1595
#define ADON                          1596
#define nDONE                         1597
#define GO_nDONE                      1598
#define NOT_DONE                      1599
#define GODONE                        1600
#define GO_DONE                       1601
#define DONE                          1602
#define GO_NOT_DONE                   1603
#define GO                            1604
#define CHS0                          1605
#define CHS                           1606
#define CHS1                          1607
#define CHS2                          1608
#define CHS3                          1609
#define CHS4                          1610
#define ADRESL                        1611
#define ADRESH                        1612
#define SSP1CON2                      1613
#define SEN1                          1614
#define SSP1CON2_SEN                  1615
#define ADMSK11                       1616
#define SSP1CON2_RSEN                 1617
#define RSEN1                         1618
#define SSP1CON2_ADMSK1               1619
#define SSP1CON2_PEN                  1620
#define ADMSK21                       1621
#define PEN1                          1622
#define SSP1CON2_ADMSK2               1623
#define ADMSK31                       1624
#define RCEN1                         1625
#define SSP1CON2_RCEN                 1626
#define SSP1CON2_ADMSK3               1627
#define SSP1CON2_ACKEN                1628
#define ACKEN1                        1629
#define ADMSK41                       1630
#define SSP1CON2_ADMSK4               1631
#define ACKDT1                        1632
#define ADMSK51                       1633
#define SSP1CON2_ACKDT                1634
#define SSP1CON2_ADMSK5               1635
#define SSP1CON2_ACKSTAT              1636
#define ACKSTAT1                      1637
#define GCEN1                         1638
#define SSP1CON2_GCEN                 1639
#define SSP1CON1                      1640
#define SSP1CON1_SSPM0                1641
#define SSPM01                        1642
#define SSP1CON1_SSPM                 1643
#define SSP1CON1_SSPM1                1644
#define SSPM11                        1645
#define SSP1CON1_SSPM2                1646
#define SSPM21                        1647
#define SSPM31                        1648
