tiborsimon/embedded-tdd-headers/pic/pic18/pic18f66k22_tdd.h
#define SSP1CON1_SSPM3                1649
#define SSP1CON1_CKP                  1650
#define CKP1                          1651
#define SSPEN1                        1652
#define SSP1CON1_SSPEN                1653
#define SSPOV1                        1654
#define SSP1CON1_SSPOV                1655
#define WCOL1                         1656
#define SSP1CON1_WCOL                 1657
#define SSP1STAT                      1658
#define BF1                           1659
#define SSP1STAT_BF                   1660
#define UA1                           1661
#define SSP1STAT_UA                   1662
#define SSP1STAT_R_NOT_W              1663
#define RW1                           1664
#define NOT_W                         1665
#define SSP1STAT_R                    1666
#define SSP1STAT_nW                   1667
#define RW                            1668
#define SSP1STAT_READ_WRITE           1669
#define SSP1STAT_nWRITE               1670
#define SSP1STAT_I2C_READ             1671
#define SSP1STAT_R_W                  1672
#define SSP1STAT_NOT_WRITE            1673
#define SSP1STAT_R_nW                 1674
#define SSP1STAT_S                    1675
#define START                         1676
#define SSP1STAT_I2C_START            1677
#define START1                        1678
#define STOP                          1679
#define SSP1STAT_P                    1680
#define STOP1                         1681
#define SSP1STAT_I2C_STOP             1682
#define SSP1STAT_D                    1683
#define SSP1STAT_D_NOT_A              1684
#define NOT_A                         1685
#define SSP1STAT_D_A                  1686
#define SSP1STAT_D_nA                 1687
#define SSP1STAT_NOT_ADDRESS          1688
#define SSP1STAT_nA                   1689
#define DA1                           1690
#define DA                            1691
#define SSP1STAT_I2C_DAT              1692
#define SSP1STAT_nADDRESS             1693
#define SSP1STAT_DATA_ADDRESS         1694
#define SSP1STAT_CKE                  1695
#define CKE1                          1696
#define SSP1STAT_SMP                  1697
#define SMP1                          1698
#define SSP1ADD_MSK0                  1699
#define MSK01                         1700
#define SSP1ADD                       1701
#define SSP1ADD_MSK1                  1702
#define MSK11                         1703
#define SSP1ADD_MSK2                  1704
#define MSK21                         1705
#define MSK31                         1706
#define SSP1ADD_MSK3                  1707
#define SSP1ADD_MSK4                  1708
#define MSK41                         1709
#define MSK51                         1710
#define SSP1ADD_MSK5                  1711
#define SSP1ADD_MSK6                  1712
#define MSK61                         1713
#define SSP1ADD_MSK7                  1714
#define MSK71                         1715
#define SSP1MSK                       1716
#define SSP1MSK_MSK0                  1717
#define SSP1MSK_MSK1                  1718
#define SSP1MSK_MSK2                  1719
#define SSP1MSK_MSK3                  1720
#define SSP1MSK_MSK4                  1721
#define SSP1MSK_MSK5                  1722
#define SSP1MSK_MSK6                  1723
#define SSP1MSK_MSK7                  1724
#define SSP1BUF                       1725
#define SSPBUF                        1726
#define T2CON                         1727
#define T2CKPS0                       1728
#define T2CKPS                        1729
#define T2CKPS1                       1730
#define TMR2ON                        1731
#define T2OUTPS0                      1732
#define T2OUTPS                       1733
#define T2OUTPS1                      1734
#define T2OUTPS2                      1735
#define T2OUTPS3                      1736
#define WM0                           1737
#define PR2                           1738
#define WM1                           1739
#define WAIT0                         1740
#define WAIT1                         1741
#define EBDIS                         1742
#define TMR2                          1743
#define T1CON                         1744
#define TMR1ON                        1745
#define T1CON_RD16                    1746
#define NOT_T1SYNC                    1747
#define nT1SYNC                       1748
#define T1OSCEN                       1749
#define T1CON_SOSCEN                  1750
#define T1CKPS0                       1751
#define T1CKPS                        1752
#define T1CKPS1                       1753
#define TMR1CS0                       1754
#define TMR1CS                        1755
#define T1RD16                        1756
#define TMR1CS1                       1757
#define TMR1L                         1758
#define TMR1H                         1759
#define RCON                          1760
#define BOR                           1761
#define NOT_BOR                       1762
#define nBOR                          1763
#define POR                           1764
#define nPOR                          1765
#define NOT_POR                       1766
#define PD                            1767
#define nPD                           1768
#define NOT_PD                        1769
#define nTO                           1770
#define TO                            1771
#define NOT_TO                        1772
#define nRI                           1773
#define NOT_RI                        1774
#define RI                            1775
#define NOT_CM                        1776
#define CM                            1777
#define nCM                           1778
#define SBOREN                        1779
#define IPEN                          1780
#define WDTCON                        1781
#define SWDTEN                        1782
#define SWDTE                         1783
#define ULPSINK                       1784
#define ULPEN                         1785
#define SRETEN                        1786
#define ULPLVL                        1787
#define REGSLP                        1788
#define IPR5                          1789
#define CCH05                         1790
#define TMR4IP                        1791
#define CCH15                         1792
#define TMR5IP                        1793
#define TMR6IP                        1794
#define EVPOL05                       1795
#define TMR7IP                        1796
#define EVPOL15                       1797
#define TMR8IP                        1798
#define TMR10IP                       1799
#define TMR12IP                       1800
#define TMR7GIP                       1801
#define OSCCON                        1802
#define SCS0                          1803
#define SCS                           1804
#define SCS1                          1805
#define HFIOFS                        1806
#define OSTS                          1807
#define IRCF                          1808
#define IRCF0                         1809
#define IRCF1                         1810
#define IRCF2                         1811
#define IDLEN                         1812
#define SPBRGH1                       1813
#define T0CON                         1814
#define T0PS                          1815
#define T0PS0                         1816
#define T0PS1                         1817
#define T0PS2                         1818
#define PSA                           1819
#define T0SE                          1820
#define T0CS                          1821
#define T08BIT                        1822
#define TMR0ON                        1823
#define TMR0L                         1824
#define TMR0H                         1825
#define STATUS                        1826
#define C                             1827
#define CARRY                         1828
#define DC                            1829
#define ZERO                          1830
#define Z                             1831
#define OV                            1832
#define OVERFLOW                      1833
#define N                             1834
#define NEGATIVE                      1835
#define FSR2L                         1836
#define PLUSW2                        1837
#define PREINC2                       1838
#define POSTDEC2                      1839
#define POSTINC2                      1840
#define INDF2                         1841
#define FSR1L                         1842
#define PLUSW1                        1843
#define PREINC1                       1844
#define POSTDEC1                      1845
#define POSTINC1                      1846
#define INDF1                         1847
#define WREG                          1848
#define FSR0L                         1849
#define PLUSW0                        1850
#define PREINC0                       1851
#define POSTDEC0                      1852
#define POSTINC0                      1853
#define INDF0                         1854
#define INTCON3                       1855
#define INT1IF                        1856
#define INT1F                         1857
#define INT2IF                        1858
#define INT2F                         1859
#define INT3F                         1860
#define INT3IF                        1861
#define INT1E                         1862
#define INT1IE                        1863
#define INT2IE                        1864
#define INT2E                         1865
#define INT3E                         1866
#define INT3IE                        1867
#define INT1P                         1868
#define INT1IP                        1869
#define INT2IP                        1870
#define INT2P                         1871
#define INTCON2                       1872
#define RBIP                          1873
#define INT3IP                        1874
#define INT3P                         1875
#define TMR0IP                        1876
#define T0IP                          1877
#define INTEDG3                       1878
#define INTEDG2                       1879
#define INTEDG1                       1880
#define INTEDG0                       1881
#define RBPU                          1882
#define NOT_RBPU                      1883
#define nRBPU                         1884
#define INTCON                        1885
#define RBIF                          1886
#define INT0F                         1887
#define INT0IF                        1888
#define T0IF                          1889
#define TMR0IF                        1890
#define RBIE                          1891
#define INT0E                         1892
#define INT0IE                        1893
#define T0IE                          1894
#define TMR0IE                        1895
#define PEIE                          1896
#define PEIE_GIEL                     1897
#define GIEL                          1898
#define GIE_GIEH                      1899
#define GIE                           1900
#define GIEH                          1901
#define PRODL                         1902
#define PRODH                         1903
#define TABLAT                        1904
#define TBLPTRL                       1905
#define TBLPTRH                       1906
#define PCL                           1907
#define PCLATH                        1908
#define PCH                           1909
#define SP0                           1910
#define STKPTR                        1911
#define SP1                           1912
#define SP2                           1913
#define SP3                           1914
#define SP4                           1915
#define STKUNF                        1916
#define STKOVF                        1917
#define STKFUL                        1918
#define TOSL                          1919
#define TOSH                          1920

#endif // _PIC18F66K22_H_
